var opendataDistricts = [
    {
        'id'    : '1',
        'title' : 'Центральный федеральный округ'
    },

    {
        'id'    : '2',
        'title' : 'Северо-Западный федеральный округ'
    },

    {
        'id'    : '3',
        'title' : 'Южный федеральный округ'
    },

    {
        'id'    : '4',
        'title' : 'Северо-Кавказский федеральный округ'
    },

    {
        'id'    : '5',
        'title' : 'Приволжский федеральный округ'
    },

    {
        'id'    : '6',
        'title' : 'Уральский федеральный округ'
    },

    {
        'id'    : '7',
        'title' : 'Сибирский федеральный округ'
    },

    {
        'id'    : '8',
        'title' : 'Дальневосточный федеральный округ'
    }
];
