ratingsNew.push({
    'data' : [
        {
            'title' : 'ПФИ',
            'value' : '0,466',
            'hint'  : '<h5>ОМ 3.2.<br /> «Обеспечение реализации программы фундаментальных научных исследований» (КБК 0110 - 611, 612, 621, 622)</h5><p>Мероприятие 3.2.1.<br /> Реализация плана фундаментальных научных исследований</p><p>Мероприятие 3.2.6.<br /> Реализация плана фундаментальных научных исследований Российской академией художеств (РАХ)</p><p>Мероприятие 3.2.7.<br /> Реализация плана фундаментальных научных исследований Российской академией архитектуры и строительных наук (РААСН)</p><p>Мероприятие 3.2.9.<br /> Реализация плана фундаментальных научных исследований Национальным исследовательским центром "Курчатовский институт"</p>'
        },

        {
            'title' : 'РНФ',
            'value' : '0,184',
            'hint'  : '<p>Мероприятие 3.2.3.<br /> Грантовое финансирование фундаментальных научных исследований Российским научным фондом</p><p>Мероприятие 3.3.1.<br /> Осуществление имущественного взноса Российской Федерации в Российский научный фонд в целях поддержки перспективных исследователей в рамках реализации проектов по приоритетным направлениям научно-технологического развития</p>'
        },

        {
            'title' : 'РФФИ',
            'value' : '0,154',
            'hint'  : '<h5>ОМ 1.4.<br /> «Развитие института научного наставничества»</h5><p>Мероприятие 1.4.1<br /> Финансовое обеспечение за счет грантов проектов фундаментальных иисследований, выполняемых молодыми учеными под руководством ведущего ученого- наставника</p><p>Мероприятие 1.4.2.<br /> Проведение открытого публичного конкурса по отбору получателей грантов на реализацию проектов фундаментальных исследований, выполняемых молодыми учеными под руководством ведущего ученого- наставника</p><h5>ОМ 1.5.<br /> «Создание института временных и постоянных позиций для исследователей»</h5><p>Мероприятие 1.5.1.<br /> Организация мероприятий по созданию института временных и постоянных позиций для исследователей</p><p>Мероприятие 1.6.4.<br /> Финансовое обеспечение за счет средств грантов проектов фундаментальных исследований, выполняемых молодыми учеными, обучающимися в аспирантуре.</p><p>Мероприятие 3.2.2.<br /> Грантовое финансирование фундаментальных научных исследований ФГБУ «Российский фонд фундаментальных исследований»</p>'
        },

        {
            'title' : 'ГЗ ФИ ВУЗ',
            'value' : '0,099',
            'hint'  : '<h5>ОМ 2.2.<br /> «Обеспечение реализации образовательных программ и научной деятельности в системе высшего образования»</h5>'
        },

        {
            'title' : 'Создание лабораторий, в т.ч. под руководством молодых ученых',
            'value' : '0,040',
            'hint'  : '<h5>ОМ 1.6.<br />«Федеральный проект «Развитие кадрового потенциала в сфере исследований и разработок»</h5><p>Мероприятие 1.6.1.<br /> Создание новых лабораторий</p><p>Мероприятие 1.6.2.<br /> Созданы новые лаборатории, не менее 30 процентами из которых руководят молодые перспективные исследователи</p><p>Мероприятие 1.6.3.<br /> Поддержаны молодые перспективные исследователи в рамках стимулирования внутрироссийской академической мобильности с учетом задач пространственного развития Российской Федерации и опережающего развития приоритетных территорий</p>'
        },

        {
            'title' : 'МСНЦ',
            'value' : '0,021',
            'hint'  : '<h5>ОМ 5.3.<br /> «Поддержка экспансии и укрепления международного авторитета национальных баз (банков) знаний, включая журналы и их коллекции»</h5><p>Мероприятие 5.3.1.<br /> Расширение участия национальных журналов и систем научного цитирования в международных системах научного цитирования</p>'
        },

        {
            'title' : 'Мегасайенс, научные суда, приборная база',
            'value' : '0,012',
            'hint'  : '<p>Мероприятие 5.6.2.<br /> Создание Международного центра нейтронных исследований (МНЦП) на базе высокопоточного реактора ПИК (в рамках НП "Наука")</p><p>Мероприятие 5.6.3.<br /> Создание первого этапа исследовательской инфраструктуры уникальной научной установки класса «мегасайенс» ЦКП "СКИФ"</p><p>Мероприятие 5.6.4.<br /> Реализация первого этапа создания источника синхротронного излучения 4-го поколения (ИССИ-4)</p><p>Мероприятие 5.6.5.<br /> Проведение международных научных исследований на уникальной научной установке класса «мегасайенс» – Комплекс сверхпроводящих колец на встречных пучках тяжелых ионов НИКА</p><p>Мероприятие 5.6.6.<br /> Реализация в Российской Федерации масштабных научных проектов мирового уровня, отобранных для проведения на российских уникальных научных установках, имеющих целью прорывных решений ключевых исследовательских задач в мировой научной повестке, получение новых фундаментальных знаний</p><p>Мероприятие 5.6.7.<br /> Строительство, модернизация, оборудование (дооборудование), ремонт и эксплуатация научно-исследовательских судов, проведение научно-исследовательских экспедиций</p><p>Мероприятие 5.6.8.<br /> Обновление приборной базы ведущих организаций, выполняющих научные исследования и разработки</p>'
        },

        {
            'title' : 'Международное сотрудничество',
            'value' : '0,006',
            'hint'  : '<h5>ОМ 4.3<br /> «Обеспечение реализации программы двух- и многостороннего научно-технологического взаимодействия»</h5><p>Мероприятие 4.3.1.<br /> Обеспечение пребывания и участия российских ученых и специалистов в научных программах зарубежных научных и международных центров</p><p>Мероприятие 4.3.2.<br /> Проведение исследований в рамках международного многостороннего и двустороннего сотрудничества, в том числе в рамках Европейского союза</p>'
        },

        {
            'title' : 'ЦКП, УНУ, ИИ',
            'value' : '0,006',
            'hint'  : '<h5>ОМ 5.1<br /> "Развитие инфраструктуры научной, научно-технической деятельности (центров коллективного пользования, уникальных научных установок)"</h5><p>Мероприятие 5.6.6.<br /> Реализация в Российской Федерации масштабных научных проектов мирового уровня, отобранных для проведения на российских уникальных научных установках, имеющих целью прорывных решений ключевых исследовательских задач в мировой научной повестке, получение новых фундаментальных знаний</p><p>Мероприятие 6.8.<br /> Поддержка и развитие уникальных научных установок</p><p>Мероприятие 6.10.<br /> Обеспечение развития информационной инфраструктуры</p><p>Мероприятие 6.9.<br /> Поддержка и развитие центров коллективного пользования научным оборудованием</p>'
        },

        {
            'title' : 'ПП 220',
            'value' : '0,003',
            'hint'  : '<h5>ОМ 1.3.<br /> «Привлечение отечественных и зарубежных ученых мирового класса к формированию в Российской Федерации новых научных коллективов»</h5><p>Мероприятие 1.3.1<br /> Реализация постановления Правительства Российской Федерации от 9 апреля 2010 г. № 220</p>'
        },

        {
            'title' : 'НП НТР 50% Молодые ученые',
            'value' : '0,003',
            'hint'  : '<p>Мероприятие 3.3.2<br /> Поддержка научных проектов по приоритетам научно-технологического развития, не менее 50 процентами из которых руководят молодые перспективные исследователи</p>'
        },

        {
            'title' : 'Премии Правительства в области НиТ',
            'value' : '0,001',
            'hint'  : '<p>Мероприятие 1.2.1.<br /> Реализация постановления Правительства Российской Федерации от 26 июля 2010 г. № 544 «Об утверждении Положения о премиях Правительства Российской Федерации в области науки и техники»</p>'
        },

        {
            'title' : 'Премии Правительства для молодых ученых',
            'value' : '0,001',
            'hint'  : '<p>Мероприятие 1.2.2.<br /> Реализация постановления Правительства Российской Федерации от 5 августа 2010 г. № 601 «Об утверждении Положения о премиях Правительства Российской Федерации в области науки и техники для молодых ученых»</p>'
        },

        {
            'title' : 'Стипендии Президента молодым ученым и аспирантам',
            'value' : '0,001',
            'hint'  : '<p>Мероприятие 1.2.3.<br /> Проведение открытого публичного конкурса по отбору получателей стипендии Президента Российской Федерации молодым ученым и аспирантам, осуществляющим перспективные научные исследования и разработки по приоритетным направлениям модернизации российской экономики</p>'
        },

        {
            'title' : 'НОЦ',
            'value' : '0,001',
            'hint'  : '<p>Мероприятие 4.5.1.<br /> Создание и функционирование Научно-образовательных центров мирового уровня (НОЦ)</p>'
        },

        {
            'title' : 'НЦМУ',
            'value' : '0,001',
            'hint'  : '<p>Мероприятие 4.5.2<br /> Создание научных центров мирового уровня, включая сеть международных математических центров и центров геномных исследований</p>'
        }
    ],

    'update' : function(cubeFace, curData) {
        var maxWidthLine = 153;
        if ($(window).width() < 1140) {
            maxWidthLine = 107;
        }

        var maxValue = 0;
        for (var i = 0; i < curData.length; i++) {
            var curValue = parseFloat(curData[i].value.replace(/,/, '.'));
            if (maxValue < curValue) {
                maxValue = curValue;
            }
        }

        var newHTML = '';

        for (var i = 0; i < curData.length; i++) {
            var curItem = curData[i];
            var curValue = parseFloat(curItem.value.replace(/,/, '.'));
            var curWidth = curValue / maxValue * maxWidthLine + 1;
            var hintSize = '';
            if (curItem.hint.length < 300) {
                hintSize = 'mini';
            }
            newHTML += '<div class="ratings-new-bars-item">' +
                            '<div class="ratings-new-bars-item-title">' + curItem.title + '</div>' +
                            '<div class="ratings-new-bars-item-info">' +
                                '<div class="ratings-new-bars-item-info-container">' +
                                    '<div class="ratings-new-bars-item-info-icon"></div>' +
                                    '<div class="ratings-new-bars-item-info-content ' + hintSize + '">' + curItem.hint + '</div>' +
                                '</div>' +
                            '</div>' +
                            '<div class="ratings-new-bars-item-line"><div class="ratings-new-bars-item-line-inner" style="width:' + curWidth + 'px"></div></div>' +
                            '<div class="ratings-new-bars-item-value">' + curItem.value + '</div>' +
                       '</div>';
        }

        cubeFace.find('.ratings-new-bars-list').html(newHTML);

        cubeFace.find('.ratings-new-bars-content').mCustomScrollbar({
            axis: 'y',
            scrollButtons: {
                enable: true
            }
        });
    }
});