ratingsNew.push({
    'filters' : [
        {
            'name'      : 'type',
            'position'  : 'left',
            'values'    : [
                {
                    'value'     : 'WoS',
                    'label'     : 'Web of Science',
                    'active'    : true
                },

                {
                    'value'     : 'Scopus',
                    'label'     : 'Scopus'
                }
            ]
        },

        {
            'name'      : 'year',
            'position'  : 'left',
            'values'    : [
                {
                    'value'     : '2017',
                    'label'     : '2017'
                },

                {
                    'value'     : '2018',
                    'label'     : '2018',
                    'active'    : true
                }
            ]
        },

        {
            'name'      : 'letter',
            'position'  : 'right',
            'values'    : [
                {
                    'value'     : 'А',
                    'label'     : 'А',
                    'icon'      : 'files/challenges-icon-02.png',
                    'text'      : 'Переход к передовым цифровым, интеллектуальным производственным технологиям, роботизированным системам, новым материалам и способам конструирования, создание систем обработки больших объемов данных, машинного обучения и искусственного интеллекта',
                    'active'    : true
                },

                {
                    'value'     : 'Б',
                    'label'     : 'Б',
                    'icon'      : 'files/challenges-icon-10.png',
                    'text'      : 'Переход к экологически чистой и ресурсосберегающей энергетике, повышение эффективности добычи и глубокой переработки углеводородного сырья, формирование новых источников, способов транспортировки и хранения энергии'
                },

                {
                    'value'     : 'В',
                    'label'     : 'В',
                    'icon'      : 'files/challenges-icon-03.png',
                    'text'      : 'Переход к персонализированной медицине, высокотехнологичному здравоохранению и технологиям здоровьесбережения, в том числе за счет рационального применения лекарственных препаратов (прежде всего антибактериальных)'
                },

                {
                    'value'     : 'Г',
                    'label'     : 'Г',
                    'icon'      : 'files/challenges-icon-08.png',
                    'text'      : 'Переход к высокопродуктивному и экологически чистому агро- и аквахозяйству, разработка и внедрение систем рационального применения средств химической и биологической защиты сельскохозяйственных растений и животных, хранение и эффективная переработка сельскохозяйственной продукции, создание безопасных и качественных, в том числе функциональных, продуктов питания'
                },

                {
                    'value'     : 'Д',
                    'label'     : 'Д',
                    'icon'      : 'files/challenges-icon-12.png',
                    'text'      : 'Противодействие техногенным, биогенным, социокультурным угрозам, терроризму и идеологическому экстремизму, а также киберугрозам и иным источникам опасности для общества, экономики и государства'
                },

                {
                    'value'     : 'Е',
                    'label'     : 'Е',
                    'icon'      : 'files/challenges-icon-14.png',
                    'text'      : 'Связанность территории Российской Федерации за счет создания интеллектуальных транспортных и телекоммуникационных систем, а также занятия и удержания лидерских позиций в создании международных транспортно-логистических систем, освоении и использовании космического и воздушного пространства, Мирового океана, Арктики и Антарктики'
                },

                {
                    'value'     : 'Ж',
                    'label'     : 'Ж',
                    'icon'      : 'files/challenges-icon-06.png',
                    'text'      : 'Возможность эффективного ответа российского общества на большие вызовы с учетом взаимодействия человека и природы, человека и технологий, социальных институтов на современном этапе глобального развития, в том числе применяя методы гуманитарных и социальных наук'
                }
            ]
        }
    ],

    'data' :  [
        {
            'type'      : 'WoS',
            'letter'    : 'А',
            'year'      : '2017',
            'data'      : [
                {
                    'title' : 'США',
                    'value' : '140024'
                },
                {
                    'title' : 'Китай',
                    'value' : '67395'
                },
                {
                    'title' : 'Индия',
                    'value' : '27652'
                },
                {
                    'title' : 'Германия',
                    'value' : '22343'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '20883'
                },
                {
                    'title' : 'Юж. Корея',
                    'value' : '19967'
                },
                {
                    'title' : 'Япония',
                    'value' : '18259'
                },
                {
                    'title' : 'Франция',
                    'value' : '17437'
                },
                {
                    'title' : 'Россия',
                    'value' : '16175'
                },
                {
                    'title' : 'Иран',
                    'value' : '15052'
                }
            ]
        },

        {
            'type'      : 'WoS',
            'letter'    : 'Б',
            'year'      : '2017',
            'data'      : [
                {
                    'title' : 'США',
                    'value' : '76657'
                },
                {
                    'title' : 'Китай',
                    'value' : '40119'
                },
                {
                    'title' : 'Германия',
                    'value' : '16200'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '14274'
                },
                {
                    'title' : 'Индия',
                    'value' : '13207'
                },
                {
                    'title' : 'Франция',
                    'value' : '11201'
                },
                {
                    'title' : 'Россия',
                    'value' : '11146'
                },
                {
                    'title' : 'Япония',
                    'value' : '10542'
                },
                {
                    'title' : 'Италия',
                    'value' : '9926'
                },
                {
                    'title' : 'Юж. Корея',
                    'value' : '9296'
                }
            ]
        },

        {
            'type'      : 'WoS',
            'letter'    : 'В',
            'year'      : '2017',
            'data'      : [
                {
                    'title' : 'Китай',
                    'value' : '87292'
                },
                {
                    'title' : 'США',
                    'value' : '75430'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '14274'
                },
                {
                    'title' : 'Германия',
                    'value' : '21338'
                },
                {
                    'title' : 'Япония',
                    'value' : '19646'
                },
                {
                    'title' : 'Италия',
                    'value' : '14630'
                },
                {
                    'title' : 'Канада',
                    'value' : '13970'
                },
                {
                    'title' : 'Франция',
                    'value' : '13628'
                },
                {
                    'title' : 'Индия',
                    'value' : '13558'
                },
                {
                    'title' : 'Австралия',
                    'value' : '10937'
                },
                {
                    'title' : 'Юж. Корея',
                    'value' : '10766'
                },
                {
                    'title' : 'Испания',
                    'value' : '10172'
                },
                {
                    'title' : 'Бразилия',
                    'value' : '9633'
                },
                {
                    'title' : 'Нидерланды',
                    'value' : '8734'
                },
                {
                    'title' : 'Иран',
                    'value' : '6843'
                },
                {
                    'title' : 'Швейцария',
                    'value' : '6391'
                },
                {
                    'title' : 'Россия',
                    'value' : '5979'
                }
            ]
        },

        {
            'type'      : 'WoS',
            'letter'    : 'Г',
            'year'      : '2017',
            'data'      : [
                {
                    'title' : 'США',
                    'value' : '76530'
                },
                {
                    'title' : 'Китай',
                    'value' : '42117'
                },
                {
                    'title' : 'Индия',
                    'value' : '16699'
                },
                {
                    'title' : 'Германия',
                    'value' : '15275'
                },
                {
                    'title' : 'Япония',
                    'value' : '12371'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '11653'
                },
                {
                    'title' : 'Бразилия',
                    'value' : '10528'
                },
                {
                    'title' : 'Юж. Корея',
                    'value' : '10419'
                },
                {
                    'title' : 'Франция',
                    'value' : '9543'
                },
                {
                    'title' : 'Испания',
                    'value' : '8795'
                },
                {
                    'title' : 'Италия',
                    'value' : '8029'
                },
                {
                    'title' : 'Россия',
                    'value' : '7963'
                }
            ]
        },

        {
            'type'      : 'WoS',
            'letter'    : 'Д',
            'year'      : '2017',
            'data'      : [
                {
                    'title' : 'США',
                    'value' : '53516'
                },
                {
                    'title' : 'Китай',
                    'value' : '48279'
                },
                {
                    'title' : 'Германия',
                    'value' : '16224'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '15647'
                },
                {
                    'title' : 'Япония',
                    'value' : '12523'
                },
                {
                    'title' : 'Индия',
                    'value' : '11799'
                },
                {
                    'title' : 'Франция',
                    'value' : '10741'
                },
                {
                    'title' : 'Юж. Корея',
                    'value' : '10235'
                },
                {
                    'title' : 'Россия',
                    'value' : '9821'
                },
                {
                    'title' : 'Италия',
                    'value' : '8380'
                }
            ]
        },

        {
            'type'      : 'WoS',
            'letter'    : 'Е',
            'year'      : '2017',
            'data'      : [
                {
                    'title' : 'США',
                    'value' : '29816'
                },
                {
                    'title' : 'Китай',
                    'value' : '22858'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '9314'
                },
                {
                    'title' : 'Германия',
                    'value' : '7347'
                },
                {
                    'title' : 'Индия',
                    'value' : '5615'
                },
                {
                    'title' : 'Франция',
                    'value' : '5400'
                },
                {
                    'title' : 'Италия',
                    'value' : '5200'
                },
                {
                    'title' : 'Юж. Корея',
                    'value' : '5090'
                },
                {
                    'title' : 'Канада',
                    'value' : '4841'
                },
                {
                    'title' : 'Япония',
                    'value' : '4391'
                },
                {
                    'title' : 'Австралия',
                    'value' : '4369'
                },
                {
                    'title' : 'Испания',
                    'value' : '4092'
                },
                {
                    'title' : 'Россия',
                    'value' : '3881'
                }
            ]
        },

        {
            'type'      : 'WoS',
            'letter'    : 'Ж',
            'year'      : '2017',
            'data'      : [
                {
                    'title' : 'Великобритания',
                    'value' : '28450'
                },
                {
                    'title' : 'США',
                    'value' : '10504'
                },
                {
                    'title' : 'Испания',
                    'value' : '6985'
                },
                {
                    'title' : 'Россия',
                    'value' : '5654'
                },
                {
                    'title' : 'Австралия',
                    'value' : '4746'
                },
                {
                    'title' : 'Германия',
                    'value' : '4636'
                },
                {
                    'title' : 'Канада',
                    'value' : '4438'
                },
                {
                    'title' : 'Бразилия',
                    'value' : '4247'
                },
                {
                    'title' : 'Китай',
                    'value' : '3627'
                },
                {
                    'title' : 'Италия',
                    'value' : '3224'
                }
            ]
        },

        {
            'type'      : 'Scopus',
            'letter'    : 'А',
            'year'      : '2017',
            'data'      : [
                {
                    'title' : 'США',
                    'value' : '171283'
                },
                {
                    'title' : 'Китай',
                    'value' : '75585'
                },
                {
                    'title' : 'Индия',
                    'value' : '37530'
                },
                {
                    'title' : 'Германия',
                    'value' : '25872'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '24207'
                },
                {
                    'title' : 'Россия',
                    'value' : '20900'
                },
                {
                    'title' : 'Япония',
                    'value' : '20753'
                },
                {
                    'title' : 'Юж. Корея',
                    'value' : '20598'
                },
                {
                    'title' : 'Франция',
                    'value' : '19455'
                },
                {
                    'title' : 'Иран',
                    'value' : '16718'
                }
            ]
        },

        {
            'type'      : 'Scopus',
            'letter'    : 'Б',
            'year'      : '2017',
            'data'      : [
                {
                    'title' : 'США',
                    'value' : '85118'
                },
                {
                    'title' : 'Китай',
                    'value' : '34027'
                },
                {
                    'title' : 'Индия',
                    'value' : '13929'
                },
                {
                    'title' : 'Германия',
                    'value' : '12373'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '11227'
                },
                {
                    'title' : 'Россия',
                    'value' : '10489'
                },
                {
                    'title' : 'Япония',
                    'value' : '9065'
                },
                {
                    'title' : 'Франция',
                    'value' : '8486'
                },
                {
                    'title' : 'Италия',
                    'value' : '8266'
                },
                {
                    'title' : 'Юж. Корея',
                    'value' : '8013'
                }
            ]
        },

        {
            'type'      : 'Scopus',
            'letter'    : 'В',
            'year'      : '2017',
            'data'      : [
                {
                    'title' : 'Китай',
                    'value' : '125711'
                },
                {
                    'title' : 'США',
                    'value' : '88467'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '33194'
                },
                {
                    'title' : 'Германия',
                    'value' : '29324'
                },
                {
                    'title' : 'Япония',
                    'value' : '25985'
                },
                {
                    'title' : 'Индия',
                    'value' : '21189'
                },
                {
                    'title' : 'Канада',
                    'value' : '19610'
                },
                {
                    'title' : 'Италия',
                    'value' : '18768'
                },
                {
                    'title' : 'Франция',
                    'value' : '18458'
                },
                {
                    'title' : 'Австралия',
                    'value' : '17356'
                },
                {
                    'title' : 'Испания',
                    'value' : '16348'
                },
                {
                    'title' : 'Юж. Корея',
                    'value' : '15429'
                },
                {
                    'title' : 'Бразилия',
                    'value' : '13418'
                },
                {
                    'title' : 'Нидерланды',
                    'value' : '12824'
                },
                {
                    'title' : 'Россия',
                    'value' : '10129'
                }
            ]
        },

        {
            'type'      : 'Scopus',
            'letter'    : 'Г',
            'year'      : '2017',
            'data'      : [
                {
                    'title' : 'США',
                    'value' : '78336'
                },
                {
                    'title' : 'Китай',
                    'value' : '41819'
                },
                {
                    'title' : 'Индия',
                    'value' : '18761'
                },
                {
                    'title' : 'Германия',
                    'value' : '14250'
                },
                {
                    'title' : 'Япония',
                    'value' : '12104'
                },
                {
                    'title' : 'Бразилия',
                    'value' : '11288'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '11079'
                },
                {
                    'title' : 'Франция',
                    'value' : '9336'
                },
                {
                    'title' : 'Юж. Корея',
                    'value' : '9145'
                },
                {
                    'title' : 'Россия',
                    'value' : '9121'
                }
            ]
        },

        {
            'type'      : 'Scopus',
            'letter'    : 'Д',
            'year'      : '2017',
            'data'      : [
                {
                    'title' : 'Китай',
                    'value' : '28423'
                },
                {
                    'title' : 'США',
                    'value' : '20368'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '11035'
                },
                {
                    'title' : 'Германия',
                    'value' : '8490'
                },
                {
                    'title' : 'Франция',
                    'value' : '5897'
                },
                {
                    'title' : 'Индия',
                    'value' : '5682'
                },
                {
                    'title' : 'Австралия',
                    'value' : '5634'
                },
                {
                    'title' : 'Италия',
                    'value' : '5602'
                },
                {
                    'title' : 'Россия',
                    'value' : '5238'
                },
                {
                    'title' : 'Канада',
                    'value' : '5120'
                }
            ]
        },

        {
            'type'      : 'Scopus',
            'letter'    : 'Е',
            'year'      : '2017',
            'data'      : [
                {
                    'title' : 'США',
                    'value' : '84173'
                },
                {
                    'title' : 'Китай',
                    'value' : '50973'
                },
                {
                    'title' : 'Индия',
                    'value' : '19298'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '19287'
                },
                {
                    'title' : 'Германия',
                    'value' : '18378'
                },
                {
                    'title' : 'Россия',
                    'value' : '13061'
                },
                {
                    'title' : 'Франция',
                    'value' : '12805'
                },
                {
                    'title' : 'Япония',
                    'value' : '12655'
                },
                {
                    'title' : 'Италия',
                    'value' : '10950'
                },
                {
                    'title' : 'Юж. Корея',
                    'value' : '10199'
                }
            ]
        },

        {
            'type'      : 'Scopus',
            'letter'    : 'Ж',
            'year'      : '2017',
            'data'      : [
                {
                    'title' : 'Великобритания',
                    'value' : '41645'
                },
                {
                    'title' : 'США',
                    'value' : '15149'
                },
                {
                    'title' : 'Австралия',
                    'value' : '7239'
                },
                {
                    'title' : 'Германия',
                    'value' : '6489'
                },
                {
                    'title' : 'Канада',
                    'value' : '6178'
                },
                {
                    'title' : 'Испания',
                    'value' : '5881'
                },
                {
                    'title' : 'Китай',
                    'value' : '4415'
                },
                {
                    'title' : 'Россия',
                    'value' : '4382'
                },
                {
                    'title' : 'Италия',
                    'value' : '3922'
                },
                {
                    'title' : 'Франция',
                    'value' : '3639'
                }
            ]
        },

        {
            'type'      : 'WoS',
            'letter'    : 'А',
            'year'      : '2018',
            'data'      : [
                {
                    'title' : 'Китай',
                    'value' : '140024'
                },
                {
                    'title' : 'США',
                    'value' : '67395'
                },
                {
                    'title' : 'Индия',
                    'value' : '27652'
                },
                {
                    'title' : 'Германия',
                    'value' : '22343'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '20883'
                },
                {
                    'title' : 'Юж. Корея',
                    'value' : '19967'
                },
                {
                    'title' : 'Япония',
                    'value' : '18259'
                },
                {
                    'title' : 'Франция',
                    'value' : '17437'
                },
                {
                    'title' : 'Россия',
                    'value' : '16175'
                },
                {
                    'title' : 'Иран',
                    'value' : '15052'
                }
            ]
        },

        {
            'type'      : 'WoS',
            'letter'    : 'Б',
            'year'      : '2018',
            'data'      : [
                {
                    'title' : 'Китай',
                    'value' : '76657'
                },
                {
                    'title' : 'США',
                    'value' : '40119'
                },
                {
                    'title' : 'Германия',
                    'value' : '16200'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '14274'
                },
                {
                    'title' : 'Индия',
                    'value' : '13207'
                },
                {
                    'title' : 'Франция',
                    'value' : '11201'
                },
                {
                    'title' : 'Россия',
                    'value' : '11146'
                },
                {
                    'title' : 'Япония',
                    'value' : '10542'
                },
                {
                    'title' : 'Италия',
                    'value' : '9926'
                },
                {
                    'title' : 'Юж. Корея',
                    'value' : '9296'
                }
            ]
        },

        {
            'type'      : 'WoS',
            'letter'    : 'В',
            'year'      : '2018',
            'data'      : [
                {
                    'title' : 'США',
                    'value' : '87292'
                },
                {
                    'title' : 'Китай',
                    'value' : '75430'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '14274'
                },
                {
                    'title' : 'Германия',
                    'value' : '21338'
                },
                {
                    'title' : 'Япония',
                    'value' : '19646'
                },
                {
                    'title' : 'Италия',
                    'value' : '14630'
                },
                {
                    'title' : 'Канада',
                    'value' : '13970'
                },
                {
                    'title' : 'Франция',
                    'value' : '13628'
                },
                {
                    'title' : 'Индия',
                    'value' : '13558'
                },
                {
                    'title' : 'Австралия',
                    'value' : '10937'
                },
                {
                    'title' : 'Юж. Корея',
                    'value' : '10766'
                },
                {
                    'title' : 'Испания',
                    'value' : '10172'
                },
                {
                    'title' : 'Бразилия',
                    'value' : '9633'
                },
                {
                    'title' : 'Нидерланды',
                    'value' : '8734'
                },
                {
                    'title' : 'Иран',
                    'value' : '6843'
                },
                {
                    'title' : 'Швейцария',
                    'value' : '6391'
                },
                {
                    'title' : 'Россия',
                    'value' : '5979'
                }
            ]
        },

        {
            'type'      : 'WoS',
            'letter'    : 'Г',
            'year'      : '2018',
            'data'      : [
                {
                    'title' : 'Китай',
                    'value' : '76530'
                },
                {
                    'title' : 'США',
                    'value' : '42117'
                },
                {
                    'title' : 'Индия',
                    'value' : '16699'
                },
                {
                    'title' : 'Германия',
                    'value' : '15275'
                },
                {
                    'title' : 'Япония',
                    'value' : '12371'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '11653'
                },
                {
                    'title' : 'Бразилия',
                    'value' : '10528'
                },
                {
                    'title' : 'Юж. Корея',
                    'value' : '10419'
                },
                {
                    'title' : 'Франция',
                    'value' : '9543'
                },
                {
                    'title' : 'Испания',
                    'value' : '8795'
                },
                {
                    'title' : 'Италия',
                    'value' : '8029'
                },
                {
                    'title' : 'Россия',
                    'value' : '7963'
                }
            ]
        },

        {
            'type'      : 'WoS',
            'letter'    : 'Д',
            'year'      : '2018',
            'data'      : [
                {
                    'title' : 'Китай',
                    'value' : '53516'
                },
                {
                    'title' : 'США',
                    'value' : '48279'
                },
                {
                    'title' : 'Германия',
                    'value' : '16224'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '15647'
                },
                {
                    'title' : 'Япония',
                    'value' : '12523'
                },
                {
                    'title' : 'Индия',
                    'value' : '11799'
                },
                {
                    'title' : 'Франция',
                    'value' : '10741'
                },
                {
                    'title' : 'Юж. Корея',
                    'value' : '10235'
                },
                {
                    'title' : 'Россия',
                    'value' : '9821'
                },
                {
                    'title' : 'Италия',
                    'value' : '8380'
                }
            ]
        },

        {
            'type'      : 'WoS',
            'letter'    : 'Е',
            'year'      : '2018',
            'data'      : [
                {
                    'title' : 'Китай',
                    'value' : '29816'
                },
                {
                    'title' : 'США',
                    'value' : '22858'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '9314'
                },
                {
                    'title' : 'Германия',
                    'value' : '7347'
                },
                {
                    'title' : 'Индия',
                    'value' : '5615'
                },
                {
                    'title' : 'Франция',
                    'value' : '5400'
                },
                {
                    'title' : 'Италия',
                    'value' : '5200'
                },
                {
                    'title' : 'Юж. Корея',
                    'value' : '5090'
                },
                {
                    'title' : 'Канада',
                    'value' : '4841'
                },
                {
                    'title' : 'Япония',
                    'value' : '4391'
                },
                {
                    'title' : 'Австралия',
                    'value' : '4369'
                },
                {
                    'title' : 'Испания',
                    'value' : '4092'
                },
                {
                    'title' : 'Россия',
                    'value' : '3881'
                }
            ]
        },

        {
            'type'      : 'WoS',
            'letter'    : 'Ж',
            'year'      : '2018',
            'data'      : [
                {
                    'title' : 'США',
                    'value' : '28450'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '10504'
                },
                {
                    'title' : 'Испания',
                    'value' : '6985'
                },
                {
                    'title' : 'Россия',
                    'value' : '5654'
                },
                {
                    'title' : 'Австралия',
                    'value' : '4746'
                },
                {
                    'title' : 'Германия',
                    'value' : '4636'
                },
                {
                    'title' : 'Канада',
                    'value' : '4438'
                },
                {
                    'title' : 'Бразилия',
                    'value' : '4247'
                },
                {
                    'title' : 'Китай',
                    'value' : '3627'
                },
                {
                    'title' : 'Италия',
                    'value' : '3224'
                }
            ]
        },

        {
            'type'      : 'Scopus',
            'letter'    : 'А',
            'year'      : '2018',
            'data'      : [
                {
                    'title' : 'Китай',
                    'value' : '171283'
                },
                {
                    'title' : 'США',
                    'value' : '75585'
                },
                {
                    'title' : 'Индия',
                    'value' : '37530'
                },
                {
                    'title' : 'Германия',
                    'value' : '25872'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '24207'
                },
                {
                    'title' : 'Россия',
                    'value' : '20900'
                },
                {
                    'title' : 'Япония',
                    'value' : '20753'
                },
                {
                    'title' : 'Юж. Корея',
                    'value' : '20598'
                },
                {
                    'title' : 'Франция',
                    'value' : '19455'
                },
                {
                    'title' : 'Иран',
                    'value' : '16718'
                }
            ]
        },

        {
            'type'      : 'Scopus',
            'letter'    : 'Б',
            'year'      : '2018',
            'data'      : [
                {
                    'title' : 'Китай',
                    'value' : '85118'
                },
                {
                    'title' : 'США',
                    'value' : '34027'
                },
                {
                    'title' : 'Индия',
                    'value' : '13929'
                },
                {
                    'title' : 'Германия',
                    'value' : '12373'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '11227'
                },
                {
                    'title' : 'Россия',
                    'value' : '10489'
                },
                {
                    'title' : 'Япония',
                    'value' : '9065'
                },
                {
                    'title' : 'Франция',
                    'value' : '8486'
                },
                {
                    'title' : 'Италия',
                    'value' : '8266'
                },
                {
                    'title' : 'Юж. Корея',
                    'value' : '8013'
                }
            ]
        },

        {
            'type'      : 'Scopus',
            'letter'    : 'В',
            'year'      : '2018',
            'data'      : [
                {
                    'title' : 'США',
                    'value' : '125711'
                },
                {
                    'title' : 'Китай',
                    'value' : '88467'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '33194'
                },
                {
                    'title' : 'Германия',
                    'value' : '29324'
                },
                {
                    'title' : 'Япония',
                    'value' : '25985'
                },
                {
                    'title' : 'Индия',
                    'value' : '21189'
                },
                {
                    'title' : 'Канада',
                    'value' : '19610'
                },
                {
                    'title' : 'Италия',
                    'value' : '18768'
                },
                {
                    'title' : 'Франция',
                    'value' : '18458'
                },
                {
                    'title' : 'Австралия',
                    'value' : '17356'
                },
                {
                    'title' : 'Испания',
                    'value' : '16348'
                },
                {
                    'title' : 'Юж. Корея',
                    'value' : '15429'
                },
                {
                    'title' : 'Бразилия',
                    'value' : '13418'
                },
                {
                    'title' : 'Нидерланды',
                    'value' : '12824'
                },
                {
                    'title' : 'Россия',
                    'value' : '10129'
                }
            ]
        },

        {
            'type'      : 'Scopus',
            'letter'    : 'Г',
            'year'      : '2018',
            'data'      : [
                {
                    'title' : 'Китай',
                    'value' : '78336'
                },
                {
                    'title' : 'США',
                    'value' : '41819'
                },
                {
                    'title' : 'Индия',
                    'value' : '18761'
                },
                {
                    'title' : 'Германия',
                    'value' : '14250'
                },
                {
                    'title' : 'Япония',
                    'value' : '12104'
                },
                {
                    'title' : 'Бразилия',
                    'value' : '11288'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '11079'
                },
                {
                    'title' : 'Франция',
                    'value' : '9336'
                },
                {
                    'title' : 'Юж. Корея',
                    'value' : '9145'
                },
                {
                    'title' : 'Россия',
                    'value' : '9121'
                }
            ]
        },

        {
            'type'      : 'Scopus',
            'letter'    : 'Д',
            'year'      : '2018',
            'data'      : [
                {
                    'title' : 'США',
                    'value' : '28423'
                },
                {
                    'title' : 'Китай',
                    'value' : '20368'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '11035'
                },
                {
                    'title' : 'Германия',
                    'value' : '8490'
                },
                {
                    'title' : 'Франция',
                    'value' : '5897'
                },
                {
                    'title' : 'Индия',
                    'value' : '5682'
                },
                {
                    'title' : 'Австралия',
                    'value' : '5634'
                },
                {
                    'title' : 'Италия',
                    'value' : '5602'
                },
                {
                    'title' : 'Россия',
                    'value' : '5238'
                },
                {
                    'title' : 'Канада',
                    'value' : '5120'
                }
            ]
        },

        {
            'type'      : 'Scopus',
            'letter'    : 'Е',
            'year'      : '2018',
            'data'      : [
                {
                    'title' : 'Китай',
                    'value' : '84173'
                },
                {
                    'title' : 'США',
                    'value' : '50973'
                },
                {
                    'title' : 'Индия',
                    'value' : '19298'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '19287'
                },
                {
                    'title' : 'Германия',
                    'value' : '18378'
                },
                {
                    'title' : 'Россия',
                    'value' : '13061'
                },
                {
                    'title' : 'Франция',
                    'value' : '12805'
                },
                {
                    'title' : 'Япония',
                    'value' : '12655'
                },
                {
                    'title' : 'Италия',
                    'value' : '10950'
                },
                {
                    'title' : 'Юж. Корея',
                    'value' : '10199'
                }
            ]
        },

        {
            'type'      : 'Scopus',
            'letter'    : 'Ж',
            'year'      : '2018',
            'data'      : [
                {
                    'title' : 'США',
                    'value' : '41645'
                },
                {
                    'title' : 'Великобритания',
                    'value' : '15149'
                },
                {
                    'title' : 'Австралия',
                    'value' : '7239'
                },
                {
                    'title' : 'Германия',
                    'value' : '6489'
                },
                {
                    'title' : 'Канада',
                    'value' : '6178'
                },
                {
                    'title' : 'Испания',
                    'value' : '5881'
                },
                {
                    'title' : 'Китай',
                    'value' : '4415'
                },
                {
                    'title' : 'Россия',
                    'value' : '4382'
                },
                {
                    'title' : 'Италия',
                    'value' : '3922'
                },
                {
                    'title' : 'Франция',
                    'value' : '3639'
                }
            ]
        }
    ],

    'update' : function(cubeFace, curData) {
        cubeFace.find('.ratings-new-priority-list').mCustomScrollbar('destroy');
        var curLetter = cubeFace.find('.rating-new-filter[data-name="letter"]').find('li.active').attr('data-value');
        var letterIndex = cubeFace.find('.rating-new-filter[data-name="letter"]').find('li').index(cubeFace.find('.rating-new-filter[data-name="letter"]').find('li.active'));
        for (var i = 0; i < this.filters.length; i++) {
            if (this.filters[i].name == 'letter') {
                for (var j = 0; j < this.filters[i].values.length; j++) {
                    if (this.filters[i].values[j].value == curLetter) {
                        cubeFace.find('.ratings-new-priority-title-text span').html(this.filters[i].values[j].label);
                        cubeFace.find('.ratings-new-priority-title-icon').html('<img src="' + this.filters[i].values[j].icon + '" alt="" />');
                        cubeFace.find('.ratings-new-priority-title-hint-content').html(this.filters[i].values[j].text);
                    }
                }
            }
        }

        cubeFace.find('.ratings-new-priority-list').each(function() {
            var maxWidthLine = 240;
            if ($(window).width() < 1140) {
                maxWidthLine = 87;
            }

            var maxValue = 0;
            for (var i = 0; i < curData.length; i++) {
                var curValue = Math.round(parseFloat(curData[i].value.replace(/,/, '.')));
                if (maxValue < curValue) {
                    maxValue = curValue;
                }
            }

            var newHTML = '<div class="ratings-new-priority-list-inner">';
            var count = 0;
            var hasRussia = false;

            for (var i = 0; i < curData.length; i++) {
                if (!hasRussia || i < 10) {
                    var curItem = curData[i];
                    var curValue = Math.round(parseFloat(curItem.value.replace(/,/, '.')));
                    var curWidth = curValue / maxValue * maxWidthLine + 1;
                    count++;
                    if (curItem.title == 'Россия') {
                        hasRussia = true;
                        if (count > 10) {
                            newHTML += '</div>';
                            newHTML += '<div class="ratings-new-priority-item-sep"></div>';
                        }
                    }

                    var flag = '';
                    for (var j = 0; j < ratingsNewFlags.length; j++) {
                        if (ratingsNewFlags[j].country == curItem.title) {
                            flag = ratingsNewFlags[j].image;
                        }
                    }

                    if (count < 11 && curItem.title == 'Россия') {
                        newHTML += '<div class="ratings-new-priority-item-rus"><div class="ratings-new-priority-item-rus-inner">';
                    }

                    newHTML += '<div class="ratings-new-priority-item">' +
                                    '<div class="ratings-new-priority-item-flag"><img src="' + flag + '" alt="" /></div>' +
                                    '<div class="ratings-new-priority-item-title">' + count + '. ' + curItem.title + '</div>' +
                                    '<div class="ratings-new-priority-item-line"><div class="ratings-new-priority-item-line-inner" style="width:' + curWidth + 'px"></div></div>' +
                                    '<div class="ratings-new-priority-item-value">' + String(curItem.value).replace(/(\d)(?=(\d\d\d)+([^\d]|$))/g, '$1 ') + '</div>' +
                               '</div>';

                    if (count < 11 && curItem.title == 'Россия') {
                        newHTML += '</div></div>';
                    }
                }

            }
            if (count < 10) {
                newHTML += '</div>';
            }

            cubeFace.find('.ratings-new-priority-list').html(newHTML);

            if ($(window).width() > 1139) {
                if (count > 10) {
                    cubeFace.find('.ratings-new-priority-list-inner').addClass('scroll').mCustomScrollbar({
                        axis: 'y'
                    });
                } else {
                    cubeFace.find('.ratings-new-priority-list-inner').removeClass('scroll').mCustomScrollbar('destroy');
                }
            } else {
                cubeFace.find('.ratings-new-priority-list-inner').removeClass('scroll').mCustomScrollbar('destroy');
                cubeFace.find('.ratings-new-priority-list').mCustomScrollbar({
                    axis: 'y'
                });
            }
        });
    }
});